## Reindexing

In [1]:
import pandas as pd
import numpy as np

In [2]:
# create a new object with the data conformed to a new index.
obj = pd.Series([4.5,7.2,-5.3,3.6], index = ['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [3]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [4]:
# For odered data like time series, it may be describele to do some interpolation or filling of 
# values when reindexing. ffill method will forward-fills the values
obj3 = pd.Series(['blue','purple','yellow'], index = [0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [5]:
obj3.reindex(range(5),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
dtype: object

In [6]:
# With DataFrame, reindex can alter either the row index, columns or both.
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index = ['a','c','d'],columns = ['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [7]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [8]:
# The columns can be reindexed with the columns keyword
states =['Texas','Utah', 'California']
frame.reindex(columns = states)
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [9]:
# reindex simply by label-indexing with loc
frame.loc[['a', 'b', 'c', 'd'], states]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [10]:
frame.reindex(['a', 'b', 'c', 'd'],columns = states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

reindex function arguments
![reindex function arguments](./figs/5-3.jpg)

### Dropping Entries from an Axis

In [11]:
obj = pd.Series(np.arange(5.), index = ['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [12]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [13]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [14]:
# With DataFrame, index values can be deleted from either axis.
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                     index=['Ohio', 'Colorado', 'Utah', 'New York'],
                     columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [15]:
# Calling drop with a sequence of labels will drop values from the row labels
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [16]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [17]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [18]:
# Many functions, like drop, which modify the size or shape of a Serie or DataFrame, can manipulae
# an object in-place without returning a new object
obj.drop('c',inplace = True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### Indexing, Selection, and Filtering

In [19]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [20]:
obj['b']

1.0

In [21]:
obj[1]

1.0

In [22]:
obj[1:3]

b    1.0
c    2.0
dtype: float64

In [23]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [24]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [25]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [26]:
# Slicing with labels behaves differently than normal Python slicing in that the endpoint is inclusive
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [27]:
# Setting using these methods modifies the correspoinding section of the Series
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [28]:
# Indexing into a DataFrameis for retriving one or more columns
data = pd.DataFrame(np.arange(16).reshape((4,4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [29]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [30]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [31]:
# Indexing like this has a few special cases. First, slicing or selecting data with a boolean array:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [32]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [33]:
# scalar comparison
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [34]:
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [35]:
# Selection with loc and ioloc
# Selection a single row and multiple columns by label:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [36]:
# choose row
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [37]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [38]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [39]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [40]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [41]:
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

 Indexing options with DataFrame
 ![ Indexing options with DataFrame](./figs/5-4.jpg)

### Integer Indexes

In [42]:
# with a integer index
# differents with indexing semantics on build-in Python data and pandas objects
ser = pd.Series(np.arange(3.))
# ser[-1] # this will genear
ser[:-1]

0    0.0
1    1.0
dtype: float64

In [43]:
# inferring what the user wants(label-based indexing or position-based) is difficult
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [44]:
# with a non-integer index, there is no potential for ambiguity
ser2 = pd.Series(np.arange(3.), index = ['a','b','c'])
ser2[-1]

2.0

In [45]:
# to keep things consistent, if you have an axis index containing integers,
# data selection will always be label-oriented.
# we can use loc(for labels) or iloc(for integers)
ser[:1]

0    0.0
dtype: float64

In [46]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [47]:
ser.iloc[:1]

0    0.0
dtype: float64

### Arithmetic and Data Alignment

In [48]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [49]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [50]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [51]:
# in the case of DataFrame, alignment is performed on both the rows and the columns:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
       index=['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [52]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                 index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [53]:
'''
Adding these together returns a DataFrame whose index and columns are the unions
of the ones in each DataFrame:
'''
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [54]:
# if you add DataFrame objects with no column or row labels in common, the result will contain all nulls
df1 = pd.DataFrame({'A': [1, 2]})
df1

   A
0  1
1  2

In [55]:
df2 = pd.DataFrame({'B': [3, 4]})
df2

   B
0  3
1  4

In [56]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN

In [57]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

### Arithmetic methods with fill values
In arithmetic operations between differently indexed objects, you might want to fill with a special value, like 0, when an axis label is found in one object but not the other:

In [58]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [59]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), columns = list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [60]:
df2.loc[1,'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [61]:
# adding these together results in NA values in the locations that don't overlap
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [62]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [63]:
# division,
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [64]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [65]:
# also , when reindexing a Series or DataFrame, you can also specify a different fill value
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

Flexible arithmetic methods
![Flexible arithmetic methods](./figs/5-5.jpg)

### Operations between DataFrame and Series

In [66]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [67]:
arr[0]

array([0., 1., 2., 3.])

In [68]:
# the subtraction is performed once for each row.
# This is referred to as broadcasting
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [69]:
# Operations between a DataFrame and a Series are similar
frame = pd.DataFrame(np.arange(12.).reshape((4,3)),
                    columns = list('bed'),
                    index=['Utah','Ohio','Texas','Oregon'])
frame

          b     e     d
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [70]:
Series = frame.iloc[0]
Series

b    0.0
e    1.0
d    2.0
Name: Utah, dtype: float64

In [71]:
frame - Series

          b    e    d
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [72]:
'''
If an index value is not found in either the DataFrame’s columns or the Series’s index,
the objects will be reindexed to form the union:
'''
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [73]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   2.0 NaN
Ohio    3.0 NaN   5.0 NaN
Texas   6.0 NaN   8.0 NaN
Oregon  9.0 NaN  11.0 NaN

In [74]:
'''
If you want to instead broadcast over the columns, matching on the rows, you have to
use one of the arithmetic methods. For example:
'''
series3 = frame['d']
series3

Utah       2.0
Ohio       5.0
Texas      8.0
Oregon    11.0
Name: d, dtype: float64

In [75]:
frame

          b     e     d
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [76]:
frame.sub(series3, axis='index')

          b    e    d
Utah   -2.0 -1.0  0.0
Ohio   -2.0 -1.0  0.0
Texas  -2.0 -1.0  0.0
Oregon -2.0 -1.0  0.0

### Function Application and Mapping
NumPy ufuncs (element-wise array methods) also work with pandas objects:

In [77]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
        index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.212318 -1.185890  0.781178
Ohio   -0.819673 -0.450111  1.224974
Texas   0.022995 -1.355349  0.421522
Oregon  0.993640 -0.772004  0.310343

In [78]:
np.abs(frame)

               b         d         e
Utah    0.212318  1.185890  0.781178
Ohio    0.819673  0.450111  1.224974
Texas   0.022995  1.355349  0.421522
Oregon  0.993640  0.772004  0.310343

In [79]:
# another frequent operation is applying a function on one-dimentional arrays
# to each column or row.
f = lambda x: x.max() - x.min()
frame.apply(f)
# Here the function f, which compute the difference between the maximum and minimum of 
# a Series, is invoked once on each column in frame.

b    1.813313
d    0.905238
e    0.914631
dtype: float64

In [80]:
# if you pass axis = "columns" to apply, the function will be invoked once per row instead
frame.apply(f, axis='columns')

Utah      1.967069
Ohio      2.044647
Texas     1.776871
Oregon    1.765644
dtype: float64

In [81]:
#  The function passed to apply  need not return a scalar value; 
# it can also return a Series with multiple values
def f(x):
    return pd.Series([x.min(),x.max()], index=['min','max'])

In [82]:
frame.apply(f)

            b         d         e
min -0.819673 -1.355349  0.310343
max  0.993640 -0.450111  1.224974

In [83]:
# Element-wise Python functions can be used, too. Supppose you want to compute
# a formatted string from each floating-point value in frame. 
format = lambda x: '%.2f' % x

In [84]:
frame.applymap(format)

            b      d     e
Utah     0.21  -1.19  0.78
Ohio    -0.82  -0.45  1.22
Texas    0.02  -1.36  0.42
Oregon   0.99  -0.77  0.31

In [85]:
# The Series has a map method for applying an element-wise function:
frame['e'].map(format)

Utah      0.78
Ohio      1.22
Texas     0.42
Oregon    0.31
Name: e, dtype: object

### Sorting and Ranking

In [86]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [87]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [88]:
# With a DataFrame, you can sort by index on either axis:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                    index = ['three','one'],
                    columns = ['d','a','b','c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [89]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [90]:
# The data is sorted in ascending order by default, but can be sorted in descending order, too
frame.sort_index(axis=1, ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [91]:
# to sort a Series by its values, use its sort_values method:
obj = pd.Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [92]:
# any missing values are sorted to the end of the Series by default
obj = pd.Series([4,np.nan, 7, np.nan, -3,2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [93]:
# When sorting a DataFrame, you can use the data in one or more columns as the
# sort keys, To do so, pass one or more column names to the by option of sort_values:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [94]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [95]:
# To sort by multiple columns, pass a list of names
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [96]:
# Ranking assigns ranks from one through the nunber of valid data points in an array. 
obj = pd.Series([7,-5,7,4,2,0,4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [97]:
obj.mean()

2.7142857142857144

In [98]:
# for duplicated values, set the average as their rank
# e.g. there are two 4, and they are ranked as 4 and 5, so they get average 4.5
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [99]:
# Ranks can also be assigned according to the order in which they are observed in the data
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [100]:
# assign til values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [101]:
# DataFrame can compute ranks over the rows or the columns:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [102]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

![Tie-breaking methods with rank](./figs/5-6.jpg)

### Axis Indexes with Duplicate Labels

In [103]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [104]:
 obj.index.is_unique

False

In [105]:
obj['a']

a    0
a    1
dtype: int64

In [106]:
obj['c']

4

In [107]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.296929  1.063981  0.741019
a -0.912428 -0.323193 -0.931383
b  0.295262  0.295346 -0.507328
b -1.055104  2.714308 -0.552856

In [108]:
df.loc['b']

          0         1         2
b  0.295262  0.295346 -0.507328
b -1.055104  2.714308 -0.552856